fix: reconciliation working
Signed-off-by: Mauro Sardara <msardara@cisco.com>
